Revit 2027 API
SpecTypeId.HvacRoughness Property
 Roughness, in discipline HVAC.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId HvacRoughness { get; }
Public Shared ReadOnly Property HvacRoughness As ForgeTypeId
	Get
public:
static property ForgeTypeId^ HvacRoughness {
	ForgeTypeId^ get ();
}
static member HvacRoughness : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
SpecTypeId Class
Autodesk.Revit.DB Namespace